#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "PNET-API-CLIENT-GENERATION"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/create-client"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "2b7c880e-206e-468f-bec6-1dfd535cafb8"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/manage-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "16ccb6e4-cff4-4ccc-a409-25cd69f2d693"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/query-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "b21835a8-bf5d-4888-a804-f576762b80cf"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/view-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "a483fa79-d717-4f03-b6bf-8d4951fee073"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/create-client"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "d957f662-6d14-48e2-b5fc-a8a9ef19000f"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "create-client"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/manage-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "d957f662-6d14-48e2-b5fc-a8a9ef19000f"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "manage-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/query-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "d957f662-6d14-48e2-b5fc-a8a9ef19000f"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "query-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "d957f662-6d14-48e2-b5fc-a8a9ef19000f"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*